# 一组有序的元素 闭区间（中括号） []

stu1= ['1001','flynn','男']

score1 = [80,90,100]

# 支持多类型

stu2=['1001','flynn','男',18]

stu2.append(100)

print(stu2[2:3]) # ['男']
print(stu2[2:-1]) # ['男', 18]
print(stu2[-1:-1]) # []
print(stu2[1:-2]) # ['flynn', '男']

## 二维列表
stus1=[
    ['1001','flynn'],
    ['1002','flynn'],
    ['1003','flynn'],
    ['1004','flynn',5],
]

## 访问 [row][col] 行-列 0 开始
var = stus1[2][1]
print(var)

# 浅拷贝和深拷贝的区别
stu11=[[0]*3]*4 # 浅拷贝 [[]] 外面 *
print(stu11) # [[0, 0, 0], [0, 0, 0], [0, 0, 0], [0, 0, 0]]
stu11[0][0]='1001' # [['1001', 0, 0], ['1001', 0, 0], ['1001', 0, 0], ['1001', 0, 0]]

print(stu11)

print('========================')
# stu12 = [[0]*3 for i in range(4)]
stu12 = [([0]*3) for i in range(4)] # [[] 里面* ]
print(stu12) # [[0, 0, 0], [0, 0, 0], [0, 0, 0], [0, 0, 0]] 一样的
stu12[0][0]='1001'
print(stu12)
